posts/nix-package-manager.html
<!doctype html>
<html lang="en-us" class=scroll-smooth data-default-appearance=light data-auto-appearance=true>
  <head>
    
    <!-- Clicky -->
    <!-- Clicky -->
    <meta charset="utf-8">
    <title>Luca's blog - Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="author" content="Luca Cambiaghi" />
    <meta name="description" content="Luca&#39;s blog" />
    <meta name="keywords" content="" />
    <link rel="stylesheet" href="https://lucacambiaghi.com/static/style.css" type="text/css" />
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    
  </head>

  <body class="flex flex-col h-screen px-6 m-auto text-lg leading-7 bg-neutral text-neutral-900 sm:px-14 md:px-24 lg:px-32 dark:bg-neutral-800 dark:text-neutral max-w-7xl">
    
    <div id=the-top class="absolute flex self-center">
  <a class="px-3 py-1 text-sm -translate-y-8 rounded-b-lg bg-primary-200 dark:bg-neutral-600 focus:translate-y-0" href=#main-content>
    <span class="font-bold ltr:pr-2 rtl:pl-2 text-primary-600 dark:text-primary-400">&darr;
    </span>Skip to main content
  </a>
</div>

<header class="flex justify-between py-6 font-semibold sm:items-center sm:py-10 text-neutral-900 dark:text-neutral print:hidden">
  <div><a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/index.html">Luca</a></div>
<nav>
  <ul class="flex list-none sm:flex-row">
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/posts.html">posts</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/emacsd.html">emacs</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/nix.html">nix</a>
    </li>
  </ul>
</nav>
</header>

    

    <main id="main" class="relative grow">
      
<article class="post">
  <h1 class="mt-0 text-4xl font-extrabold text-neutral-900 dark:text-neutral">
    Nix, the functional package manager
  </h1>
  <div class="mt-8 mb-8 text-base text-neutral-500 dark:text-neutral-400 print:hidden">
    <div class="flex flex-row flex-wrap items-center">
      <time> Nov 01, 2020
      </time>
      <span class="px-2 text-primary-500">&#183;</span>
      <span title="tags">(nix home-manager)
      </span>
    </div>
  </div>

  <section class="flex flex-col max-w-full mt-0 prose lg:flex-row dark:prose-invert">
    <div class="min-w-0 min-h-0 max-w-prose">
      
<div id="outline-container-why-should-you-care" class="outline-2">
<h2 id="why-should-you-care">Why should you care?</h2>
<div class="outline-text-2">
<p>
I recently had to restore my Mac, as I covered in my previous blog post.
I have now experienced what it is to start from scratch and have a software configure your new OS.
</p>

<p>
It was liberating to think that next time it would take me less than an hour to get up to speed.
This is called having a portable configuration.
Of course, the solution I described was not portable, actually limited to macOS.
</p>

<p>
I spent the past week or so learning about Nix.
Nix is a functional package manager that takes the concept of portable configuration to its furthest point.
In <code>NixOS</code> you can declare your whole system configuration, including hardware (eg. audio and display drivers).
</p>

<p>
It is the oldest story in the world, it is what the <code>.emacs</code> allows the Emacs user to do.
Declare the needed packages and how you want them configured, bring your configuration with you forever.
<code>nix</code> extends this power to the entire computing environment.
</p>

<p>
My objective was to declare the fundamental building blocks of my workflow:
</p>
<ul class="org-ul">
<li><code>CLI</code> packages (<code>kubectl</code>, <code>python</code>, <code>poetry</code>, etc.)</li>
<li><code>GUI</code> apps (Dropbox, 1Password, Slack, etc.)</li>
<li><code>zsh</code> (<code>oh-my-zsh</code>, plugins, theme, etc.)</li>
<li><code>emacs</code> (<code>gccemacs</code> and <code>~/.doom.d/</code>)</li>
<li>Dotfiles (e.g. <code>~/.kube/config</code>, <code>~/.ssh/id_rsa.pub</code>, &#x2026;)</li>
</ul>
</div>
</div>

<div id="outline-container-installing-nix" class="outline-2">
<h2 id="installing-nix">Installing Nix</h2>
<div class="outline-text-2">
<p>
If you are on <code>macOS</code>, there are very high chances you are using <code>brew</code>.
It is stable, user friendly, basically all packages are available.
</p>

<p>
Well, <code>nix</code> is far from that user experience.
I found its documentation quite difficult.
The installation process was hard.
There are not so many examples online you can learn from.
</p>

<p>
Let me now give you the good news.
As it is common with software that is difficult to tame..
it is totally worth it.
</p>

<p>
When you get a stable installation and you climb the first part of the steep learning curve..
it is impossible to come back.
Like Emacs.
</p>

<p>
So, with a good dose of patience follow my tutorial.
</p>
</div>

<div id="outline-container-create-the-nix-volume" class="outline-3">
<h3 id="create-the-nix-volume">Create the <code>nix</code> volume</h3>
<div class="outline-text-3">
<p>
If you have the latest <code>macOS</code> Catalina, we will need to create a volume
where <code>nix</code> will download packages and build our environment.
A very cool feature is that we will be able to roll-back to previous "generations" of our environment.
</p>

<p>
We will issue a few commands at the terminal.
We are not doing anything dramatic and if something goes wrong we can easily delete the volume with Disk Utility and start the process from the beginning.
For reference, I followed <a href="https://www.philipp.haussleiter.de/2020/04/fixing-nix-setup-on-macos-catalina/">this</a> and <a href="https://dubinets.io/installing-nix-on-macos-catalina/">this</a> blog posts.
</p>

<p>
First we create the volume with the <code>diskutil</code> program:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo diskutil apfs addVolume disk1 &#8216;APFS&#8217; nix
</pre>
</div>

<p>
Then we need to ask <code>diskutil</code> for the <code>UUID</code> of our volume:
</p>

<div class="org-src-container">
<pre class="src src-sh">diskutil info /dev/disk1s6 | grep UUID
</pre>
</div>

<p>
Let's copy that information and paste it in the below command:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">"UUID=12345678-1234-1234-1234-123456789123 /nix apfs  rw"</span> | sudo tee -a /etc/fstab
</pre>
</div>

<p>
Finally, let's edit the <code>/etc/synthetic.conf</code> file:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">'nix'</span> | sudo tee -a /etc/synthetic.conf
</pre>
</div>

<p>
and restart.
</p>
</div>
</div>

<div id="outline-container-iinstall-nix" class="outline-3">
<h3 id="iinstall-nix">Iinstall <code>nix</code></h3>
<div class="outline-text-3">
<p>
After the restart, we can set the volume as read-only:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chown -R $(whoami) /nix
</pre>
</div>

<p>
And install <code>nix</code>:
z
</p>
<div class="org-src-container">
<pre class="src src-sh">sh &lt;(curl -L https://nixos.org/nix/install) --darwin-use-unencrypted-nix-store-volume --daemon
</pre>
</div>

<p>
The installer is pretty straightforward.
To test that the installation went through, try a <code>nix-shell</code> command:
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-shell -p ripgrep
</pre>
</div>

<p>
If everything went well, congratulations!
Else, head over to the Troubleshooting section.
</p>
</div>
</div>

<div id="outline-container-install-nix-darwin" class="outline-3">
<h3 id="install-nix-darwin">Install <code>nix-darwin</code></h3>
<div class="outline-text-3">
<p>
In order for <code>nix</code> to control some of the system services of <code>macOS</code>, we need to install <code>nix-darwin</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-build https://github.com/LnL7/nix-darwin/archive/master.tar.gz -A installer
</pre>
</div>

<p>
And execute the built installer:
</p>

<div class="org-src-container">
<pre class="src src-sh">./result/bin/darwin-installer
</pre>
</div>

<p>
Finally, let's add the <code>nixpkgs</code> channel:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo -i nix-channel --add https://nixos.org/channels/nixpkgs-20.09-darwin nixpkgs
sudo -i nix-channel --update nixpkgs
</pre>
</div>

<p>
A channel is simply a repository where <code>nix</code> will look for downloads.
<a href="https://github.com/NixOS/nixpkgs">Here</a> you can find the repository with the "recipe" for all the packages.
Once you gained confidence with the <code>nix</code> language, it is easy to write a recipe for a package and contribute it to the community.
</p>
</div>
</div>

<div id="outline-container-troubleshooting" class="outline-3">
<h3 id="troubleshooting">Troubleshooting</h3>
<div class="outline-text-3">
<p>
Skip this section if you installed successfully.
</p>

<p>
In case the <code>nix</code> commands are not available to your path:
</p>
<ul class="org-ul">
<li>First check that <code>source ~/.nix-profile/etc/profile.d/nix.sh</code> is in your <code>~/.zshrc</code> or <code>~/.bashrc</code></li>
<li>Next, check that your <code>.nix-profile</code> is populated.</li>
</ul>

<p>
In my case, it was empty and I had to create the symlink myself with:
</p>

<div class="org-src-container">
<pre class="src src-sh">ln -s /nix/var/nix/profiles/default/bin .nix-profile
</pre>
</div>

<p>
And then switching profile:
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-env --switch-profile /nix/var/nix/profiles/per-user/$<span class="org-variable-name">USER</span>/profile
</pre>
</div>

<p>
I faced another couple of misteryous errors when installing <code>nix-darwin</code>, solved by exporting environment variables as indicated in some remote github issues.
Export them and run the commands again:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">NIX_SSL_CERT_FILE</span>=<span class="org-string">"/nix/var/nix/profiles/default/etc/ssl/certs/ca-bundle.crt"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">NIX_PATH</span>=~/.nix-defexpr/channels:$<span class="org-variable-name">NIX_PATH</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-home-manager" class="outline-2">
<h2 id="home-manager">Home Manager</h2>
<div class="outline-text-2">
<p>
Alright, the complicated part is behind us.
We have just opened the door to new cool functional workflows.
</p>

<p>
The <code>nix</code> ecosystem is rich and complex.
I started with a package which aims to simplify "home" configuration.
It is called <a href="https://github.com/nix-community/home-manager">Home Manager</a>.
</p>

<p>
I recommend to start by cloning <a href="https://github.com/ryantm/home-manager-template">this repository</a>.
It contains a great template that you can start customizing right away.
</p>

<p>
The main thing to consider is the <code>home.nix</code> file:
</p>

<div class="org-src-container">
<pre class="src src-nix">{ pkgs, ... }:
{
  <span class="org-nix-attribute">home.username</span> = <span class="org-string">"$USER"</span>;
  <span class="org-nix-attribute">home.homeDirectory</span> = <span class="org-string">"$HOME"</span>;
  <span class="org-nix-attribute">home.stateVersion</span> = <span class="org-string">"20.09"</span>;
  <span class="org-comment">#</span>
  <span class="org-nix-attribute">programs.bash</span> = {
    <span class="org-nix-attribute">enable</span> = <span class="org-nix-builtin">true</span>;
  };
  <span class="org-nix-attribute">home.packages</span> = [
    pkgs.htop
    pkgs.fortune
  ];
}
</pre>
</div>

<p>
Start by inserting your username and home directory.
</p>

<p>
Now you can run the helper commands available in the repo:
z
</p>
<div class="org-src-container">
<pre class="src src-sh">./update-dependencies.sh
./switch.sh
</pre>
</div>

<p>
When the process completes, start a new shell.
If you didn't have it before, you have installed <code>htop</code> and can use it in your terminal.
</p>

<p>
It also installed another <code>bash</code> executable.
You can see all executables with <code>which -a</code>:
z
</p>
<div class="org-src-container">
<pre class="src src-sh">~ &#10095; which -a bash
/Users/luca/.nix-profile/bin/bash
/run/current-system/sw/bin/bash
/bin/bash
</pre>
</div>

<p>
When you ran <code>switch</code>, <code>nix</code> downloaded the declared packages and symlinked the executables in your <code>~/.nix-profile</code> folder.
<code>nix</code> will simply add the packages to your <code>PATH</code> and it will not break your existing installation.
</p>

<p>
This is great because you can slowly migrate your <code>brew</code> packages.
And if something goes wrong, you can rollback to the previously built configuration with:
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-env --rollback
</pre>
</div>

<p>
In fact, I accepted that on <code>macOS</code> my <code>home-manager</code> configuration will live algonside a <code>Brewfile</code> to install <code>GUI</code> apps (<code>brew cask</code> is much more stable and furnished).
Restoring my system will just amount to:
</p>

<div class="org-src-container">
<pre class="src src-sh">./update-dependencies.sh
./switch.sh
<span class="org-comment-delimiter"># </span><span class="org-comment">install brew</span>
ruby -e <span class="org-string">"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"</span>
brew bundle
</pre>
</div>

<p>
and this is an extract of my <code>Brewfile</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Taps</span>
tap <span class="org-string">"homebrew/cask"</span>
tap <span class="org-string">"homebrew/cask-versions"</span>
tap <span class="org-string">"homebrew/core"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Not available on nixpkgs</span>
brew <span class="org-string">"azure-cli"</span>
brew <span class="org-string">"parquet-tool"</span>
brew <span class="org-string">"mas"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">GUI apps</span>
cask <span class="org-string">"1password6"</span>
cask <span class="org-string">"discord"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-next-steps" class="outline-2">
<h2 id="next-steps">Next steps</h2>
<div class="outline-text-2">
<p>
In this short post I tried to keep things simple.
There is a lot to explore in the ecosystem.
</p>

<p>
Some of the great tools to learn about:
</p>
<ul class="org-ul">
<li><code>nix-shell</code> allows you to spawn a shell with declared dependencies.
Think one shell for building a LaTeX document.
Another shell for a <code>python</code> project.
You can avoid polluting your system and achieve stable, portable, sharable environments.</li>
<li>The logical follower is <code>nix-build</code>, which allows you to package your <code>python</code> project easily.</li>
<li>We have seen <code>nix-env</code> in action with <code>home-manager</code>.
It is used for managing system configuration.</li>
</ul>

<p>
I will just end with a link to my personal <code>nixpkgs</code> repo which holds <a href="https://github.com/lccambiaghi/nixpkgs">my home configuration</a>.
</p>
</div>
</div>

    </div>
  </section>

  <section>
    <div id="hyvor-talk-view"></div>
    <hyvor-talk-comments website-id="793" page-id="nix-package-manager"></hyvor-talk-comments>
  </section>

  <!-- <div class="absolute top-[110vh] ltr:right-0 rtl:left-0 w-12 pointer-events-none bottom-[-5.5rem]"> -->
  <!--   <a href="#the-top" class="w-12 h-12 sticky pointer-events-auto top-[calc(100vh-5rem)] bg-neutral/50 dark:bg-neutral-800/50 backdrop-blur rounded-full text-xl flex items-center justify-center text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400" aria-label="Scroll to top" title="Scroll to top">↑</a> -->
  <!-- </div> -->

</article>

    </main>

    <footer class="py-10 print:hidden">
      
      <div class="flex justify-between">
  <div>
    <p class="text-sm text-neutral-500 dark:text-neutral-400">&copy;
      Luca Cambiaghi
    </p>
    <p class="text-xs text-neutral-500 dark:text-neutral-400">Theme inspired by
      <a class="hover:underline hover:decoration-primary-400 hover:text-primary-500" "href=https://git.io/hugo-congo" target=_blank rel="noopener noreferrer">Congo
      </a>
    </p>
  </div>
  <div class="text-sm cursor-pointer text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400 ltr:mr-14 rtl:ml-14">
    <button id=appearance-switcher class="w-12 h-12" type=button title="Switch to dark appearance">
      <span class="inline dark:hidden"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z"/></svg></span></span><span class="hidden dark:inline"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z"/></svg></span></span></button></div></div>

      
    </footer>

  </body>
</html>
